; domain
(define (domain emergency-services-logistics)
  (:requirements :strips :typing :negative-preconditions)
  (:types
    robotic_agent
    location
    box
    content - object
    person
  )

  (:constants
    food - content
    tools - content
    medicine - content
    depot - location
  )


  (:predicates
    (empty ?b - box)
    (content_in_box ?c - content ?b - box)    ;il contenuto è nella box 
    (content_needed ?p - person ?c - content) ;il bisogno di ogni singola persona 

    (at_robot_loc ?r - robotic_agent ?l - location)     
    (at_box_loc ?b - box ?l - location)      
    (at_content_loc ?c - content ?l - location)
    (at_person_loc ?c - person ?l - location)

    (loaded ?r - robotic_agent ?b - box)
    (empty_robot ?r - robotic_agent)
  )


  (:action pickup
    :parameters (?r - robotic_agent ?l - location ?b - box)
    :precondition (and
      (at_robot_loc ?r ?l)
      (at_box_loc ?b ?l)
      (empty ?b)
      (not (loaded ?r ?b))
      (empty_robot ?r)
    )
    :effect (and 
        (loaded ?r ?b)
        (not (empty_robot ?r))
        )
  )


  (:action fill
    :parameters (?r - robotic_agent ?l - location ?b - box ?c - content ?p - person)
    :precondition (and 
      (at_robot_loc ?r ?l)
      (at_content_loc ?c ?l)
      (empty ?b)
      (not (empty_robot ?r))
      (loaded ?r ?b)
      (content_needed ?p ?c)
    )
    :effect (and (not (empty ?b))
        (content_in_box ?c ?b))
  )

    ; Nella prima versione avevamo due azioni move, una verso la persona e l'altra verso il depot
    ; Le abbiamo unite in una singola

  (:action move
    :parameters (?r - robotic_agent ?from ?to - location)
    :precondition (and
      (at_robot_loc ?r ?from)
      (not (at_robot_loc ?r ?to))
    )
    :effect (and
      (at_robot_loc ?r ?to)
      (not (at_robot_loc ?r ?from))
    )
  )

  
  (:action deliver
    :parameters (?r - robotic_agent ?l - location ?b - box ?c - content ?p - person)
    :precondition (and
      (at_robot_loc ?r ?l)
      (at_person_loc ?p ?l)
      (not (empty_robot ?r))
      (loaded ?r ?b)
      (not (empty ?b))
      (content_needed ?p ?c) 
      (content_in_box ?c ?b)
    )
    :effect(and
        (not (content_in_box ?c ?b))
        (empty ?b)
        (not (content_needed ?p ?c))
    )
  )
)

; problem
(define (problem problem1)
  (:domain emergency-services-logistics)

  (:objects
    r1 - robotic_agent
    l1 l2 l3 - location
    b1 b2 b3 b4 b5 - box
    p1 p2 - person
  )
  

  (:init
  
    ; Initial locations of robotic agent and boxes
    (at_robot_loc r1 depot)
    (at_box_loc b1 depot)
    (at_content_loc food depot)
    (at_content_loc tools depot)
    (at_content_loc medicine depot)
    

    ; Contents are initially at the depot (l1)
    
    ; People and their initial locations
    (at_person_loc p1 l2)
    (at_person_loc p2 l3)

    ; Initial state of boxes (empty)

    (content_needed p1 food)
    (content_needed p2 tools)
    (content_needed p1 medicine)
    (content_needed p1 tools)

    ; Add more needs for other persons if required

    ; Loaded state of robotic agent
    (empty b1)

    (empty_robot r1)
   
  )

  ; Goal state: Ensure that certain people have certain contents
  (:goal
    (and
      ; Assign content to persons as per their needs
        (not (content_needed p1 food))
        (not (content_needed p2 tools))
        (not (content_needed p1 tools))
        (not (content_needed p1 medicine))

    )
  )
)

; plan
1. (pickup r1 depot b1)
   deleted: (empty_robot r1)
   added: (loaded r1 b1)
   goals met: 0 of 4
2. (fill r1 depot b1 food p1)
   deleted: (empty b1)
   added: (content_in_box food b1)
   goals met: 0 of 4
3. (move r1 depot l2)
   deleted: (at_robot_loc r1 depot)
   added: (at_robot_loc r1 l2)
   goals met: 0 of 4
4. (deliver r1 l2 b1 food p1)
   deleted: (content_in_box food b1) (content_needed p1 food)
   added: (empty b1)
   goals met: 1 of 4
5. (move r1 l2 depot)
   deleted: (at_robot_loc r1 l2)
   added: (at_robot_loc r1 depot)
   goals met: 1 of 4
6. (fill r1 depot b1 medicine p1)
   deleted: (empty b1)
   added: (content_in_box medicine b1)
   goals met: 1 of 4
7. (move r1 depot l2)
   deleted: (at_robot_loc r1 depot)
   added: (at_robot_loc r1 l2)
   goals met: 1 of 4
8. (deliver r1 l2 b1 medicine p1)
   deleted: (content_in_box medicine b1) (content_needed p1 medicine)
   added: (empty b1)
   goals met: 2 of 4
9. (move r1 l2 depot)
   deleted: (at_robot_loc r1 l2)
   added: (at_robot_loc r1 depot)
   goals met: 2 of 4
10. (fill r1 depot b1 tools p1)
   deleted: (empty b1)
   added: (content_in_box tools b1)
   goals met: 2 of 4
11. (move r1 depot l2)
   deleted: (at_robot_loc r1 depot)
   added: (at_robot_loc r1 l2)
   goals met: 2 of 4
12. (deliver r1 l2 b1 tools p1)
   deleted: (content_in_box tools b1) (content_needed p1 tools)
   added: (empty b1)
   goals met: 3 of 4
13. (move r1 l2 depot)
   deleted: (at_robot_loc r1 l2)
   added: (at_robot_loc r1 depot)
   goals met: 3 of 4
14. (fill r1 depot b1 tools p2)
   deleted: (empty b1)
   added: (content_in_box tools b1)
   goals met: 3 of 4
15. (move r1 depot l3)
   deleted: (at_robot_loc r1 depot)
   added: (at_robot_loc r1 l3)
   goals met: 3 of 4
16. (deliver r1 l3 b1 tools p2)
   deleted: (content_in_box tools b1) (content_needed p2 tools)
   added: (empty b1)
   goals met: 4 of 4
